export const json = {
  title: "COVID-19 Screening Form",
  description:
    "All fields with an asterisk (*) are required fields and must be filled out in order to process the information in strict confidentiality.",
  logo:
    "https://api.surveyjs.io/private/Surveys/files?name=fe375fa6-4c8c-40ab-a9c7-51a97b7ad500",
  questionErrorLocation: "bottom",
  logoFit: "cover",
  logoPosition: "right",
  pages: [
    {
      name: "teacher-info",
      title: "Teacher Information",
      elements: [
        {
          type: "panel",
          name: "full-name",
          title: "Full name",
          elements: [
            {
              type: "text",
              name: "first-name",
              title: "First name",
              isRequired: false,
              maxLength: 25
            },
            {
              type: "text",
              name: "last-name",
              startWithNewLine: false,
              title: "Last name",
              isRequired: false,
              maxLength: 25
            }
          ]
        },
        {
          type: "panel",
          name: "personal-info",
          elements: [
            {
              type: "text",
              name: "ssn",
              title: "Social Security number",
              isRequired: false,
              maxLength: 9,
              validators: [
                {
                  type: "regex",
                  text: "Your SSN must be a 9-digit number.",
                  regex: "^\\d{9}$"
                }
              ]
            },
            {
              type: "text",
              name: "birthdate",
              startWithNewLine: false,
              title: "Date of Birth",
              isRequired: false,
              inputType: "date"
            }
          ]
        }
      ]
    },
    {
      name: "School Concept",
      title: "เป้าหมายหนึ่งเดียวกัน (School Concept)",
      elements: [
        {
          type: "panel",
          name: "School Concept",
          title:
            "การประเมินพัฒนาการ Change ที่ 1 - ทุกคนในโรงเรียนร่วมกันสะท้อนว่า โรงเรียนมีพัฒนาการตรงกับคำอธิบายของ rubric ช่องไหน โดยสามารถใช้ตัวอย่างคำถามนำการสะท้อน และ พูดคุยกันด้วยการอ้างอิงถึงหลักฐานเชิงประจักษ์ของโรงเรียน",
          elements: [
            {
              type: "matrix",
              name: "SubTopicA",
              title: "ประเด็นพิจารณาใน Change ที่ 1",
              columns: [
                "ยังไม่เริ่มต้น",
                "กำลังพัฒนา",
                "พัฒนาดีขึ้น",
                "พัฒนาอย่างยั่งยืน"
              ],
              rows: [
                {
                  value: "QuestionA",
                  text:
                    "ผู้บริหารและทีมครู/ชุมชนร่วมกันสร้างความเข้าใจในทิศทางและกำหนดวิสัยทัศน์ เป้าหมายที่มาจากข้อมูลจริง (สอดคล้องกับฐานทุนเดิมของโรงเรียนและชุมชน และ ผลลัพธ์ที่พึงประสงค์ของการศึกษา)"
                },
                {
                  value: "QuestionB",
                  text:
                    "วิสัยทัศน์และเป้าหมายส่งต่อถึงแผนการพัฒนา (1) นักเรียน (เช่น ปรับโครงสร้างเวลาเรียน ปรับกลุ่มวิชา กลุ่มสาระวิชา และการเรียนแบบบูรณาการ) (2) ครู (ปรับการพัฒนาวิชาชีพ) และ (3) โรงเรียนที่ชัดเจนและสอดคล้องกัน"
                },
                {
                  value: "QuestionC",
                  text:
                    "ครูสามารถนำวิสัยทัศน์ เป้าหมาย และแผนการพัฒนาไปสู่การออกแบบแผนการเรียนการสอนที่สะท้อนผลสัมฤทธิ์ด้าน A/S/K "
                },
                {
                  value: "QuestionD",
                  text:
                    "นักเรียน ครู และโรงเรียนติดตามการพัฒนาตามเป้าหมายอย่างสม่ำเสมอ"
                }
              ],
              cells: {
                QuestionA: {
                  ยังไม่เริ่มต้น:
                    "วิสัยทัศน์และเป้าหมายของโรงเรียนไม่ชัดเจนหรือไม่ถูกติดตามอย่างใกล้ชิด",
                  กำลังพัฒนา:
                    "โรงเรียนมีกระบวนการที่ช่วยกันวิเคราะห์วิสัยทัศน์และออกแบบ และมีเป้าหมายการพัฒนาโรงเรียนอย่างคร่าวๆ",
                  พัฒนาดีขึ้น:
                    "โรงเรียนมีกระบวนการที่ช่วยวิเคราะห์วิสัยทัศน์ และมีเป้าหมายการพัฒนาจากข้อมูลจริง และมีการบันทึกแผนการพัฒนาโรงเรียนในช่วงปิดภาคเรียน รายปีและระยะยาวในเอกสารอย่างชัดเจน โรงเรียนมีการติดตามการพัฒนาและปรับเปลี่ยนเป้าหมายอย่างเหมาะสมเพื่อผลักดันการเรียนรู้และเสริมสร้างผลสัมฤทธิ์ด้าน A/S/K",
                  พัฒนาอย่างยั่งยืน:
                    "โรงเรียนสร้างเป้าหมายการพัฒนาจากข้อมูลจริงและอ้างอิงทฤษฎีสู่การปฏิบัติ ผ่านกระบวนการออกแบบร่วมกัน และมีการบันทึกแผนการพัฒนาโรงเรียนในช่วงปิดภาคเรียน รายปีและระยะยาวในเอกสารอย่างชัดเจน โรงเรียนมีการติดตามการพัฒนาและปรับเปลี่ยนเป้าหมายเพื่อทำให้เกิดความเปลี่ยนแปลงที่สัมพันธ์กับการเรียนรู้และผลสัมฤทธิ์ A/S/K"
                },
                QuestionB: {
                  ยังไม่เริ่มต้น:
                    "มีการกำหนดแผนการพัฒนานักเรียน การพัฒนาวิชาชีพในระดับโรงเรียน และโรงเรียน แต่แผนเหล่านี้ไม่ได้มาจากข้อมูลจริงหรือตามความต้องการของผู้เรียน",
                  กำลังพัฒนา:
                    "มีการกำหนดแผนการพัฒนานักเรียน การพัฒนาวิชาชีพในระดับโรงเรียน และโรงเรียน  โดยอ้างอิงผลจากการเก็บข้อมูลความต้องการของผู้เรียนอย่างผิวเผิน ทำให้มีการปรับปรุง กระบวนการเรียนได้ไม่ชัดเจนหรือไม่สม่ำเสมอ",
                  พัฒนาดีขึ้น:
                    "มีการกำหนดแผนการพัฒนานักเรียน การพัฒนาวิชาชีพในระดับโรงเรียน และโรงเรียนอย่างชัดเจนและสอดคล้อง โดยอ้างอิงผลจากการเก็บข้อมูลความต้องการของผู้เรียน ทำให้เกิดการปรับปรุงการเรียนการสอนในห้องเรียน",
                  พัฒนาอย่างยั่งยืน:
                    "มีการกำหนดแผนการพัฒนานักเรียน การพัฒนาวิชาชีพในระดับโรงเรียน และโรงเรียนได้อย่างชัดเจนและสอดคล้อง โดยอ้างอิงข้อสรุปจากการเก็บข้อมูลความต้องการของผู้เรียน ทำให้เกิดการปรับปรุงการเรียนการสอนในห้องเรียนและการปรับปรุงกระบวนการทำงานของโรงเรียนด้วย"
                },
                QuestionC: {
                  ยังไม่เริ่มต้น:
                    "วิสัยทัศน์ เป้าหมาย ไม่ปรากฏชัดเจนในแผนการเรียนการสอน",
                  กำลังพัฒนา:
                    "วิสัยทัศน์ เป้าหมาย มีปรากฏขึ้นอย่างคร่าวๆ ในแผนการเรียนการสอน แต่ยังขาดความสม่ำเสมอ",
                  พัฒนาดีขึ้น:
                    "วิสัยทัศน์ เป้าหมาย มีปรากฏขึ้นอย่างชัดเจนในแผนการเรียนการสอนส่วนใหญ่ รวมทั้งมีการบันทึกและนำผลการใช้แผนการสอนไปปรับปรุงแผนการสอนด้วยข้อมูลจริง",
                  พัฒนาอย่างยั่งยืน:
                    "วิสัยทัศน์ เป้าหมาย มีปรากฏขึ้นอย่างชัดเจนในแผนการเรียนการสอนส่วนใหญ่ รวมทั้งมีการบันทึกและนำผลการใช้แผนการสอนปรับปรุงแผนการสอน และทบทวนเป้าหมายของโรงเรียน"
                },
                QuestionD: {
                  ยังไม่เริ่มต้น:
                    "ผู้บริหารโรงเรียนไม่สื่อสารและไม่ให้ครู ผู้ปกครองและนักเรียนมีส่วนร่วมในการตัดสินใจหรือวางแผนการพัฒนาโรงเรียน",
                  กำลังพัฒนา:
                    "ผู้บริหารโรงเรียนสื่อสารและให้ครู ผู้ปกครองและนักเรียนมีส่วนร่วมในการตัดสินใจหรือวางแผนการพัฒนาโรงเรียนอย่างจำกัด",
                  พัฒนาดีขึ้น:
                    "ผู้บริหารโรงเรียนสื่อสารและให้ครู ผู้ปกครองและนักเรียนมีส่วนร่วมในการตัดสินใจหรือวางแผนการพัฒนาโรงเรียน",
                  พัฒนาอย่างยั่งยืน:
                    "ผู้บริหารโรงเรียนสื่อสารและให้ครู ผู้ปกครองและนักเรียนมีส่วนร่วมในการตัดสินใจหรือวางแผนการพัฒนาโรงเรียนอย่างมีประสิทธิภาพ"
                }
              }
            }
          ]
        }
      ]
    }
  ],
  completeText: "Submit",
  showPreviewBeforeComplete: "showAnsweredQuestions",
  showQuestionNumbers: false,
  focusFirstQuestionAutomatic: false,
  widthMode: "static",
  width: "1000px"
};
